{
  "basics": {
    "name": "Eric Sakmar",
    "label": "Software Engineer",
    "image": "",
    "email": "eric.sakmar@gmail.com",
    "phone": "(814) 934-0702",
    "url": "https://ericsakmar.com",
    "summary": "Principal software engineer with over 15 years of experience across the full stack. Excels at adapting to new technologies and techniques as a result of working with clients ranging from small startups to the United States Department of Defense. Strives to create software that is readable and maintainable using a practical knowledge of current patterns and principles.",
    "location": {
      "city": "Pittsburgh",
      "countryCode": "US",
      "region": "PA"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "ericsakmar",
        "url": "https://github.com/ericsakmar"
      },
      {
        "network": "LinkedIn",
        "username": "eric-sakmar",
        "url": "https://www.linkedin.com/in/eric-sakmar"
      }
    ],
    "currentSkills": [
      "React",
      "TypeScript",
      "JavaScript",
      "HTML",
      "CSS",
      "C#",
      "Vim",
      "RxJS",
      "Redux",
      "Node.js",
      "Git",
      "React Native"
    ],
    "previousSkills": [
      "Java",
      "Objective C",
      "Ruby on Rails",
      "SQL",
      "D3",
      "Angular",
      "Vue",
      "Scala",
      "Electron",
      "Xamarin"
    ]
  },

  "work": [
    {
      "name": "Truefit",
      "location": "Pittsburgh, PA",
      "description": "We’re a team of strategists, product owners, designers, architects, engineers, and testers collaborating to create new software products that deliver both business and user value.",
      "positions": [
        {
          "title": "Principal Software Engineer",
          "startDate": "2019-05-01",
          "endDate": "Present"
        },
        {
          "title": "Senior Software Engineer",
          "startDate": "2019-01-01",
          "endDate": "2019-05-01"
        }
      ],
      "url": "https://truefit.io",
      "summary": "Hired as a senior software engineer and quickly became a trusted and productive team member through creating quality code, contributing to architecture decisions, and reviewing code. Current focus is on exploring new technologies and applying them to prototype projects.",
      "highlights": [
        "Prototype development of a mobile app and web-based admin portal for collecting data from medical wearables.",
        "Full stack development of a multi-platform application for creating and viewing educational content. Converted an existing application from proprietary technologies to a stack based on open source libraries and standards compliant technology.",
        "Full stack development of a suite of web-based applications for maintaining healthcare data."
      ]
    },

    {
      "name": "Concurrent Technologies Corporation",
      "location": "Johnstown, PA; Alexandria, VA; Arlington, VA; Pittsburgh, PA",
      "description": "We support our clients’ core mission objectives with customized, full lifecycle solutions.",
      "positions": [
        {
          "title": "Senior Software Engineer",
          "startDate": "2016-06-01",
          "endDate": "2018-12-01"
        },
        {
          "title": "Software Engineer",
          "startDate": "2010-05-01",
          "endDate": "2016-06-01"
        },
        {
          "title": "Associate Software Engineer",
          "startDate": "2008-05-01",
          "endDate": "2010-05-01"
        },
        {
          "title": "Assistant Software Engineer",
          "startDate": "2006-05-01",
          "endDate": "2008-05-01"
        },
        {
          "title": "Technical Intern",
          "startDate": "2004-02-01",
          "endDate": "2006-05-01"
        }
      ],
      "url": "https://www.ctc.com/",
      "summary": "Hired for a full-time position after a 2 year internship. Gathered a lot of experience and took on many new responsibilities through working on a broad range of projects in several different cities.",
      "highlights": [
        "Full stack development in maintaining and updating a large enterprise application. Migrated the application from a tightly coupled monolith to a component based and service oriented architecture.",
        "Mobile development, native and web, of a wide range of apps. These often had tight schedules and required a keen knowledge of the nuances and idioms of the various platforms and devices.",
        "Back end development of services for digital learning content. This included federated search, content sharing and discovery, and managing course assets."
      ]
    }
  ],

  "education": [
    {
      "institution": "University of Pittsburgh",
      "location": "Johnstown, PA",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "2002-08-01",
      "endDate": "2006-05-01",
      "summary": "Presidential Scholar, Magna Cum Laude"
    }
  ]
}
